In [1]:
import pandas as pd

In [2]:
log = pd.read_csv("module3_log.csv")  
log = log.dropna()  
log.columns = ['user_id', 'time', 'bet', 'win']  
log['time'] = log['time'].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])  
log.time.apply(lambda x: x.minute) 
log['time'].head()

13    2019-01-02 08:57:36
28    2019-01-04 13:59:42
150   2019-01-16 21:54:22
188   2019-01-21 18:34:44
204   2019-01-22 05:26:59
Name: time, dtype: datetime64[ns]

In [3]:
log = pd.read_csv('module3_log.csv', header=None)
users = pd.read_csv('module3_users.csv', encoding='KOI8-R', sep='\t')
log.columns = ['user_id', 'time', 'bet', 'win']
users.columns = ['user_id', 'email', 'geo']

In [5]:
log['time'].isna().sum()

15

In [6]:
log.dropna()

,user_id,time,bet,win
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
967,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
971,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
976,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0

In [7]:
log.dropna(axis=1)

                              user_id
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

In [8]:
log.drop_duplicates(subset = ['user_id', 'time'])

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [9]:
a=int(0)
for i in log.time.dropna():
    if '2' in i: 
        a+=1
a

985

In [10]:
log['time'] = log['time'][log['time'].notna()].apply(lambda x: x.replace('[',''))

In [11]:
log['time'] = pd.to_datetime(log['time'])

In [12]:
log['time'].max()

Timestamp('2019-04-20 18:10:07')

In [13]:
log['time'][14]

Timestamp('2019-01-02 08:57:36')

In [14]:
log['time'].head()

0   2019-01-01 14:06:51
1   2019-01-01 14:51:16
2   2019-01-01 16:31:16
3   2019-01-01 17:17:51
4   2019-01-01 21:31:18
Name: time, dtype: datetime64[ns]

In [15]:
log.time.apply(lambda x: x.minute).dropna().head()

0     6.0
1    51.0
2    31.0
3    17.0
4    31.0
Name: time, dtype: float64

In [16]:
log['time'].dt.day

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
995    20.0
996     NaN
997     NaN
998     NaN
999     NaN
Name: time, Length: 1000, dtype: float64

In [17]:
log['time'].dt.dayofweek

0      1.0
1      1.0
2      1.0
3      1.0
4      1.0
      ...
995    5.0
996    NaN
997    NaN
998    NaN
999    NaN
Name: time, Length: 1000, dtype: float64

year: возвращает год

month: возвращает месяц

day: возвращает день

hour, minute, second - час, минута, секунда

dayofweek - день недели, от 0 до 6, где 0 - понедельник, 6 - воскресенье

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timestamp.html

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html

In [18]:
log['time'].dt.dayofyear

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
       ...
995    110.0
996      NaN
997      NaN
998      NaN
999      NaN
Name: time, Length: 1000, dtype: float64

In [19]:
log['time'].dt.minute.value_counts().index[0]

36.0

In [20]:
log['time'].dt.month.value_counts().index[-1]

4.0

In [21]:
log['time'].dt.dayofweek.value_counts().loc[[5,6]].sum()

283

In [22]:
time2 = log['time'].dropna().dt.hour

In [23]:
time2.apply(lambda x: 0 if x<=5 
            else 1 if x<=11 
            else 2 if x<=17 
            else 3).value_counts()

0    265
1    253
2    240
3    227
Name: time, dtype: int64

In [24]:
log = pd.read_csv("module3_log.csv", header=None)  
log.columns = ['user_id', 'time', 'bet', 'win']  
log = log.dropna()
log['time'] = log['time'].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time']) 
log['hour'] = log['time'].dt.hour

In [25]:
log['hour']

14      8
29     13
151    21
189    18
205     5
       ..
967    22
971    10
972    10
976    10
991    12
Name: hour, Length: 133, dtype: int64

In [26]:
log

,user_id,time,bet,win,hour
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5
...,...,...,...,...,...
967,Запись пользователя № - user_975,2019-04-19 22:25:15,1000.0,6108.0,22
971,Запись пользователя № - user_912,2019-04-20 10:35:49,10554.0,31799.0,10
972,Запись пользователя № - user_926,2019-04-20 10:35:50,10354.0,30244.0,10
976,Запись пользователя № - user_970,2019-04-20 10:35:54,10354.0,30691.0,10
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,12

In [27]:
log['bet'].fillna(0).value_counts().sum

<bound method Series.sum of 500.0        17
400.0        14
100.0        13
200.0        13
1000.0       12
800.0        12
900.0         9
300.0         8
700.0         8
600.0         6
10154.0       5
10554.0       3
10254.0       2
10354.0       2
10654.0       2
9954.0        2
10754.0       2
145732.0      1
8700.0        1
1678321.0     1
Name: bet, dtype: int64>

In [28]:
log = pd.read_csv("module3_log.csv", header=None)   
log.columns = ['user_id', 'time', 'bet', 'win']  
log['time'] = log['time'][log['time'].notna()].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])

In [29]:
log

                              user_id                time      bet      win
0    Запись пользователя № - user_919 2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973 2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903 2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954 2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954 2019-01-01 21:31:18      NaN      NaN
..                                ...                 ...      ...      ...
995  Запись пользователя № - user_984 2019-04-20 09:59:58   9754.0      NaN
996                            #error                 NaT  10054.0  29265.0
997                            #error                 NaT  10454.0      NaN
998                            #error                 NaT   1000.0      NaN
999                            #error                 NaT  10754.0      NaN

[1000 rows x 4 columns]

In [30]:
log['bet'].fillna(0).value_counts()

0.0          515
500.0         50
100.0         48
300.0         42
800.0         42
200.0         40
400.0         40
700.0         38
600.0         37
1000.0        37
900.0         30
9754.0        10
10554.0       10
10154.0        7
10254.0        7
10454.0        6
9954.0         6
10754.0        5
10654.0        5
10354.0        4
10054.0        4
9854.0         2
5000.0         1
27000.0        1
9876.0         1
156789.0       1
12945.0        1
12548.0        1
145732.0       1
1678321.0      1
98753.0        1
123981.0       1
104540.0       1
8700.0         1
950.0          1
8734.0         1
7650.0         1
Name: bet, dtype: int64

In [168]:
def fillna_win(row):
    if row.isna()[2]: row['win'] = 0
    elif ((row['bet']>0)&(row.isna()[3])): row['win']=-row['bet']
    return pd.Series([row['win']])

In [170]:
new_win = log.apply(lambda row: fillna_win(row), axis=1) # !!! axis=1 is very impotant here

In [171]:
new_win

           0
0        0.0
1        0.0
2        0.0
3        0.0
4        0.0
..       ...
995  -9754.0
996  29265.0
997 -10454.0
998  -1000.0
999 -10754.0

[1000 rows x 1 columns]

In [172]:
log['win'] = new_win

In [173]:
log

                              user_id                time      bet      win
0    Запись пользователя № - user_919 2019-01-01 14:06:51      NaN      0.0
1    Запись пользователя № - user_973 2019-01-01 14:51:16      NaN      0.0
2    Запись пользователя № - user_903 2019-01-01 16:31:16      NaN      0.0
3    Запись пользователя № - user_954 2019-01-01 17:17:51      NaN      0.0
4    Запись пользователя № - user_954 2019-01-01 21:31:18      NaN      0.0
..                                ...                 ...      ...      ...
995  Запись пользователя № - user_984 2019-04-20 09:59:58   9754.0  -9754.0
996                            #error                 NaT  10054.0  29265.0
997                            #error                 NaT  10454.0 -10454.0
998                            #error                 NaT   1000.0  -1000.0
999                            #error                 NaT  10754.0 -10754.0

[1000 rows x 4 columns]

In [177]:
log['win'][log['win']<0]

5     -156789.0
19     -98753.0
67      -5000.0
81    -123981.0
92       -100.0
         ...
994    -10354.0
995     -9754.0
997    -10454.0
998     -1000.0
999    -10754.0
Name: win, Length: 347, dtype: float64

In [178]:
log['bet'] = log['bet'].fillna(0)

In [179]:
log

                              user_id                time      bet      win
0    Запись пользователя № - user_919 2019-01-01 14:06:51      0.0      0.0
1    Запись пользователя № - user_973 2019-01-01 14:51:16      0.0      0.0
2    Запись пользователя № - user_903 2019-01-01 16:31:16      0.0      0.0
3    Запись пользователя № - user_954 2019-01-01 17:17:51      0.0      0.0
4    Запись пользователя № - user_954 2019-01-01 21:31:18      0.0      0.0
..                                ...                 ...      ...      ...
995  Запись пользователя № - user_984 2019-04-20 09:59:58   9754.0  -9754.0
996                            #error                 NaT  10054.0  29265.0
997                            #error                 NaT  10454.0 -10454.0
998                            #error                 NaT   1000.0  -1000.0
999                            #error                 NaT  10754.0 -10754.0

[1000 rows x 4 columns]

In [181]:
log['net'] = log['win'] - log['bet']
log

,user_id,time,bet,win,net
0,Запись пользователя № - user_919,2019-01-01 14:06:51,0.0,0.0,0.0
1,Запись пользователя № - user_973,2019-01-01 14:51:16,0.0,0.0,0.0
2,Запись пользователя № - user_903,2019-01-01 16:31:16,0.0,0.0,0.0
3,Запись пользователя № - user_954,2019-01-01 17:17:51,0.0,0.0,0.0
4,Запись пользователя № - user_954,2019-01-01 21:31:18,0.0,0.0,0.0
...,...,...,...,...,...
995,Запись пользователя № - user_984,2019-04-20 09:59:58,9754.0,-9754.0,-19508.0
996,#error,NaT,10054.0,29265.0,19211.0
997,#error,NaT,10454.0,-10454.0,-20908.0
998,#error,NaT,1000.0,-1000.0,-2000.0
999,#error,NaT,10754.0,-10754.0,-21508.0

In [182]:
log[log['net']>0]

,user_id,time,bet,win,net
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,1841921.0
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,8198222.0
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,4649.0
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,4467.0
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,4019.0
...,...,...,...,...,...
981,#error,NaT,800.0,7035.0,6235.0
986,#error,NaT,10454.0,29972.0,19518.0
987,#error,NaT,10554.0,31634.0,21080.0
991,Запись пользователя № - user_965,2019-04-20 12:55:41,800.0,6927.0,6127.0
996,#error,NaT,10054.0,29265.0,19211.0

In [183]:
log[log['net']>0].mean()

bet    15367.688406
win    95621.021739
net    80253.333333
dtype: float64

In [184]:
log[log['net']>0].median()

bet     600.0
win    5935.0
net    5347.0
dtype: float64

In [186]:
log.bet.mean()

3291.083

In [187]:
log = pd.read_csv("module3_log.csv", header=None)   
log.columns = ['user_id', 'time', 'bet', 'win']  
log['time'] = log['time'][log['time'].notna()].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])

In [191]:
log.bet.dropna().shape[0]

485

In [192]:
log.bet.mean()

6785.738144329897

In [193]:
log.bet.sum()

3291083.0

In [194]:
3291083.0/485

6785.738144329897

In [198]:
log = pd.read_csv("module3_log.csv", header=None)   
log.columns = ['user_id', 'time', 'bet', 'win']  
log['time'] = log['time'][log['time'].notna()].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])  
log['bet'] = log['bet'].fillna(0)
log['win'] = log['win'].fillna(0)
log['net'] = log['win'] - log['bet']

In [199]:
log

,user_id,time,bet,win,net
0,Запись пользователя № - user_919,2019-01-01 14:06:51,0.0,0.0,0.0
1,Запись пользователя № - user_973,2019-01-01 14:51:16,0.0,0.0,0.0
2,Запись пользователя № - user_903,2019-01-01 16:31:16,0.0,0.0,0.0
3,Запись пользователя № - user_954,2019-01-01 17:17:51,0.0,0.0,0.0
4,Запись пользователя № - user_954,2019-01-01 21:31:18,0.0,0.0,0.0
...,...,...,...,...,...
995,Запись пользователя № - user_984,2019-04-20 09:59:58,9754.0,0.0,-9754.0
996,#error,NaT,10054.0,29265.0,19211.0
997,#error,NaT,10454.0,0.0,-10454.0
998,#error,NaT,1000.0,0.0,-1000.0
999,#error,NaT,10754.0,0.0,-10754.0

In [201]:
len(log[log['bet']>0])/len(log)

0.485

In [208]:
log['net'][log['bet']!=0].mean()

20421.892783505155

In [209]:
log['net'][log['bet']!=0].value_counts()

-100.0     35
-300.0     34
-500.0     33
-600.0     31
-700.0     30
           ..
 6235.0     1
 6382.0     1
 4790.0     1
 4133.0     1
-5000.0     1
Name: net, Length: 168, dtype: int64

In [210]:
log['net'][log['net']<0].mean()

-3372.743515850144

In [215]:
# % of win
len(log['net'][log['net']>0])/len(log[log['bet']>0])/len(log[log['bet']>0])

0.0005866723349984057

In [214]:
# % of loose
len(log['net'][log['net']<0])/len(log[log['bet']>0])

0.7154639175257732

In [212]:
len(log[log['bet']>0])

485

In [213]:
len(log['net'][log['net']<0])

347

In [221]:
log = pd.read_csv("module3_log.csv", header=None)   
log.columns = ['user_id', 'time', 'bet', 'win'] 
min_bet_amount = len(log[log['bet']==log['bet'].min()])

In [222]:
min_bet_amount

48